# AirFanType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AirSystemData..::..AirFanType Property
AirSystemData Class See Also
---
The fan type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public AirFanType AirFanType { get; set; }
```

Visual Basic
---
```text
Public Property AirFanType As AirFanType
	Get
	Set
```

Visual C++
---
```text
public:
property AirFanType AirFanType {
	AirFanType get ();
	void set (AirFanType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace